Taurus/basic.yaml
execution:
- executor: jmeter
  concurrency: 10
  hold-for: 2m
  ramp-up: 1m
  scenario: basic
- executor: jmeter    #second executor for more than one scenario, executor is not mandatory
  scenario: basic_two

senarios:
  basic:
    requests:
    - https://www.demoblaze.com

  basic_two:    
    script: /path/to/script.jmx   #For scripts