Taurus/shellexec_csv.yaml
execution:
- executor: jmeter
  concurrency: 2
  hold-for: 1m
  ramp-up: 1m
  steps: 0 # Ramp-up steps
  scenario: basic

senarios:
  basic:    
    script: test_basic.jmx

services:
- module: shellexec
  prepare:  
  - mkdir /tmp/test && cd /tmp/test/
  startup:
  - curl -iv  uat-dfd.cambridgeinternational.org:443 > /tmp/test/curl.log
 # shutdown:
 # - echo 'shutdown' >> /tmp/test/log 
  #post-process:
  #- rm /tmp/test/log


#services:
#- module: shellexec
#  prepare: # stage names: [prepare, startup, check]
#  - command: echo 1 > /tmp/1.txt && sleep 1 && dmesg | grep pci  # task command
#    background: true  # wait for task completion or send it to background, false by default. 
#    ignore-failure: true  # false by default, otherwise will shut tests down if command return code != 0, 
#    out: taskout.txt  # set file name for task stdout, null to print to stdout
#    err: taskerr.txt  # set file name for task stderr, null to print to stdout
#    run-at: local  # provisioning level to limit command usage, null to run always
##    cwd: artifacts-dir  # option to change working dir for command, null to not change it
                        # special value 'artifacts-dir' will change to taurus artifacts dir
#   env:  # environment variables to set for command
#     VAR1: val1
#     VAR2: val2